In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
pd.set_option('display.max_rows', 1000)

uni = pd.read_csv('universities.csv', delimiter = ',', header = 0)

In [2]:
uni.head()

,name,address,Website,Type,Size
0,A T Still University of Health Sciences,"800 W Jefferson, Kirksville, Missouri 63501",WWW.ATSU.EDU,"4-year, Private not-for-profit",3480.0
1,Abilene Christian University,"1600 Campus Court, Abilene, Texas 79699",www.acu.edu,"4-year, Private not-for-profit",4669.0
2,Abraham Baldwin Agricultural College,"2802 Moore Hwy, Tifton, Georgia 31793-2601",www.abac.edu,"4-year, primarily associate's, Public",3600.0
3,Academy College,"1101 E. 78th Street, Suite 100, Minneapolis, M...",www.academycollege.edu,"4-year, primarily associate's, Private for-profit",165.0
4,Academy for Five Element Acupuncture,"305 SE 2nd Ave, Gainesville, Florida 32601",www.acupuncturist.edu,"4-year, Private not-for-profit",51.0

In [3]:
uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2907 entries, 0 to 2906
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     2907 non-null   object
 1   address  2907 non-null   object
 2   Website  2822 non-null   object
 3   Type     2907 non-null   object
 4   Size     2829 non-null   float64
dtypes: float64(1), object(4)
memory usage: 113.7+ KB

In [4]:
uni.columns

Index(['name', 'address', 'Website', 'Type', 'Size'], dtype='object')

In [5]:
uni.index

RangeIndex(start=0, stop=2907, step=1)

##  Mean size by each university type

In [6]:
grouped = uni.groupby('Type')
grouped.mean().sort_values(by = 'Size', ascending = True)

                                                            Size
Type
4-year, primarily associate's, Private for-profit     934.380597
4-year, primarily associate's, Private not-for-...   1129.413793
4-year, Private not-for-profit                       2399.885696
4-year, Private for-profit                           3504.501859
4-year, primarily associate's, Public                6889.366197
4-year, Public                                      11478.913765

##  Median size by each university type

In [7]:
grouped.median().sort_values(by = 'Size', ascending = True)

                                                      Size
Type
4-year, primarily associate's, Private for-profit    564.5
4-year, Private for-profit                           730.0
4-year, primarily associate's, Private not-for-...   768.0
4-year, Private not-for-profit                      1206.0
4-year, primarily associate's, Public               3558.0
4-year, Public                                      7669.0

In [8]:
cityzip = uni.address.str.rsplit(' ', 1, expand = True)
cityzip = cityzip.dropna()
cityzip

                                                      0           1
0                 800 W Jefferson, Kirksville, Missouri       63501
1                     1600 Campus Court, Abilene, Texas       79699
2                       2802 Moore Hwy, Tifton, Georgia  31793-2601
3     1101 E. 78th Street, Suite 100, Minneapolis, M...  55420-1554
4                  305 SE 2nd Ave, Gainesville, Florida       32601
...                                                 ...         ...
2902  13315 W. Washington Boulevard, Los Angeles, Ca...       90066
2903                      1125 E 8th St, York, Nebraska  68467-2699
2904                Country Club Rd, York, Pennsylvania  17403-3651
2905             One University Plaza, Youngstown, Ohio  44555-0001
2906    320 South Main Street, Haverhill, Massachusetts       01835

[2907 rows x 2 columns]

In [9]:
addresses = cityzip[0].str.rsplit(',', 2, expand = True)
addresses = addresses.dropna()
addresses

                                   0             1               2
0                    800 W Jefferson    Kirksville        Missouri
1                  1600 Campus Court       Abilene           Texas
2                     2802 Moore Hwy        Tifton         Georgia
3     1101 E. 78th Street, Suite 100   Minneapolis       Minnesota
4                     305 SE 2nd Ave   Gainesville         Florida
...                              ...           ...             ...
2902   13315 W. Washington Boulevard   Los Angeles      California
2903                   1125 E 8th St          York        Nebraska
2904                 Country Club Rd          York    Pennsylvania
2905            One University Plaza    Youngstown            Ohio
2906           320 South Main Street     Haverhill   Massachusetts

[2835 rows x 3 columns]

In [10]:
city = addresses[1]
city

0         Kirksville
1            Abilene
2             Tifton
3        Minneapolis
4        Gainesville
            ...
2902     Los Angeles
2903            York
2904            York
2905      Youngstown
2906       Haverhill
Name: 1, Length: 2835, dtype: object

In [11]:
state = addresses[2]
state

0             Missouri
1                Texas
2              Georgia
3            Minnesota
4              Florida
             ...
2902        California
2903          Nebraska
2904      Pennsylvania
2905              Ohio
2906     Massachusetts
Name: 2, Length: 2835, dtype: object

In [12]:
zipcode = cityzip[1]
zipcode

0            63501
1            79699
2       31793-2601
3       55420-1554
4            32601
           ...
2902         90066
2903    68467-2699
2904    17403-3651
2905    44555-0001
2906         01835
Name: 1, Length: 2907, dtype: object

In [13]:
types = uni.Type.str.rsplit(', ',1, expand = True)
associates = types[0].str.split(', ', expand = True)
associates = associates[1]
associates

0                        None
1                        None
2       primarily associate's
3       primarily associate's
4                        None
                ...
2902                     None
2903                     None
2904                     None
2905                     None
2906                     None
Name: 1, Length: 2907, dtype: object

In [14]:
types = types[1].str.split(' ', expand = True)
for_profit = types[1]
pub_priv = types[0]

In [33]:
uni['city'] = city
uni['state'] = state
uni['zipcode'] = zipcode
uni['for_profit'] = for_profit
uni['pub_priv'] = pub_priv
uni['associates'] = associates

##  Final Dataframe

In [49]:
uni['associates'] = uni.associates.fillna(0)
uni['associates'] = uni.associates.replace("primarily associate's", 1)
# uni["Associates"] = np.where((uni["Associates"] == " primarily associate's" )[:, None], 1, 0) #.tolist()
# uni.drop(['Type'], axis = 1, inplace = True) #removes whole column
uni

,name,address,Website,Type,Size,city,state,zipcode,for_profit,pub_priv,associates
0,A T Still University of Health Sciences,"800 W Jefferson, Kirksville, Missouri 63501",WWW.ATSU.EDU,"4-year, Private not-for-profit",3480.0,Kirksville,Missouri,63501,not-for-profit,Private,0
1,Abilene Christian University,"1600 Campus Court, Abilene, Texas 79699",www.acu.edu,"4-year, Private not-for-profit",4669.0,Abilene,Texas,79699,not-for-profit,Private,0
2,Abraham Baldwin Agricultural College,"2802 Moore Hwy, Tifton, Georgia 31793-2601",www.abac.edu,"4-year, primarily associate's, Public",3600.0,Tifton,Georgia,31793-2601,None,Public,1
3,Academy College,"1101 E. 78th Street, Suite 100, Minneapolis, M...",www.academycollege.edu,"4-year, primarily associate's, Private for-profit",165.0,Minneapolis,Minnesota,55420-1554,for-profit,Private,1
4,Academy for Five Element Acupuncture,"305 SE 2nd Ave, Gainesville, Florida 32601",www.acupuncturist.edu,"4-year, Private not-for-profit",51.0,Gainesville,Florida,32601,not-for-profit,Private,0
...,...,...,...,...,...,...,...,...,...,...,...
2902,Yo San University of Traditional Chinese Medicine,"13315 W. Washington Boulevard, Los Angeles, Ca...",www.yosan.edu,"4-year, Private not-for-profit",139.0,Los Angeles,California,90066,not-for-profit,Private,0
2903,York College,"1125 E 8th St, York, Nebraska 68467-2699",www.york.edu/,"4-year, Private not-for-profit",396.0,York,Nebraska,68467-2699,not-for-profit,Private,0
2904,York College Pennsylvania,"Country Club Rd, York, Pennsylvania 17403-3651",www.ycp.edu,"4-year, Private not-for-profit",5627.0,York,Pennsylvania,17403-3651,not-for-profit,Private,0
2905,Youngstown State University,"One University Plaza, Youngstown, Ohio 44555-0001",www.ysu.edu,"4-year, Public",13704.0,Youngstown,Ohio,44555-0001,None,Public,0
2906,Zion Bible College,"320 South Main Street, Haverhill, Massachusett...",www.zbc.edu,"4-year, Private not-for-profit",247.0,Haverhill,Massachusetts,01835,not-for-profit,Private,0

##  Mean size by state

In [79]:
group_st = uni.groupby('state')['Size']
# group_st = uni.groupby('state')['Size'].mean()
group_st.mean().round(2)

state
 Alabama                  5303.62
 Alaska                   5945.60
 Arizona                 10704.05
 Arkansas                 3967.69
 California               3980.66
 Colorado                 4497.00
 Connecticut              3025.62
 Delaware                 3490.00
 District of Columbia     7423.59
 Florida                  5599.01
 Georgia                  3912.04
 Guam                     1768.00
 Hawaii                   3375.15
 Idaho                    6059.73
 Illinois                 4046.21
 Indiana                  4114.89
 Iowa                     3731.20
 Kansas                   2728.35
 Kentucky                 3217.28
 Louisiana                4803.27
 Maine                    2075.32
 Maryland                 4393.20
 Massachusetts            3540.30
 Michigan                 3819.46
 Minnesota                3769.41
 Mississippi              3548.79
 Missouri                 3314.18
 Montana                  3795.10
 Nebraska                 2882.47
 Nevada                   6275.21
 New Hampshire            2630.80
 New Jersey               5653.79
 New Mexico               2034.15
 New York                 3805.05
 North Carolina           4146.53
 North Dakota             2981.00
 Northern Marianas         791.00
 Ohio                     3676.88
 Oklahoma                 3742.53
 Oregon                   2663.08
 Pennsylvania             3506.53
 Puerto Rico              3356.18
 Rhode Island             5014.30
 South Carolina           2619.70
 South Dakota             2492.61
 Tennessee                2776.29
 Texas                    5423.81
 Utah                     6375.96
 Vermont                  1596.87
 Virgin Islands           2393.00
 Virginia                 3698.13
 Washington               4355.30
 West Virginia            4439.52
 Wisconsin                4565.54
 Wyoming                  4075.00
Name: Size, dtype: float64

##  Median size by state

In [69]:
group_st.median()

state
 Alabama                 1693.0
 Alaska                  2954.0
 Arizona                  986.5
 Arkansas                1755.0
 California               891.0
 Colorado                1075.0
 Connecticut             1889.0
 Delaware                2233.0
 District of Columbia    1389.0
 Florida                 1178.0
 Georgia                 1891.0
 Guam                    1768.0
 Hawaii                  1140.0
 Idaho                   1939.0
 Illinois                1275.0
 Indiana                 1233.0
 Iowa                    1343.5
 Kansas                   623.0
 Kentucky                1421.0
 Louisiana               3048.5
 Maine                   1455.0
 Maryland                2077.0
 Massachusetts           1655.0
 Michigan                1952.0
 Minnesota                968.0
 Mississippi             2365.0
 Missouri                 867.0
 Montana                 1313.0
 Nebraska                 904.0
 Nevada                  1117.5
 New Hampshire           1300.0
 New Jersey              3457.5
 New Mexico               564.5
 New York                1462.5
 North Carolina          1365.0
 North Dakota            1019.0
 Northern Marianas        791.0
 Ohio                    1655.0
 Oklahoma                1919.0
 Oregon                  1031.0
 Pennsylvania            2037.5
 Puerto Rico             1724.0
 Rhode Island            4204.5
 South Carolina          1502.0
 South Dakota            1560.0
 Tennessee                934.5
 Texas                   2512.5
 Utah                     646.0
 Vermont                  731.0
 Virgin Islands          2393.0
 Virginia                1120.0
 Washington              1558.5
 West Virginia           1443.0
 Wisconsin               1982.0
 Wyoming                  146.0
Name: Size, dtype: float64

##  Mean size by public or private

In [80]:
group_pp = uni.groupby('pub_priv')['Size']
group_pp.mean().round(2)

pub_priv
Private     2304.23
Public     10995.45
Name: Size, dtype: float64

##  Median size by public or private

In [71]:
group_pp.median()

pub_priv
Private     948.0
Public     7081.0
Name: Size, dtype: float64

## Mean by primarily associate's

In [81]:
group_asc = uni.groupby('associates')
group_asc.mean().round(2)

               Size
associates
0           4801.80
1           1966.71

## Median by primarily associate's

In [55]:
group_asc.median()

              Size
associates
0           1727.0
1            716.0

## Sum size by state

In [72]:
group_st.sum()

state
 Alabama                 222752.0
 Alaska                   29728.0
 Arizona                 428162.0
 Arkansas                103160.0
 California              915552.0
 Colorado                211359.0
 Connecticut              96820.0
 Delaware                 17450.0
 District of Columbia    126201.0
 Florida                 694277.0
 Georgia                 297315.0
 Guam                      3536.0
 Hawaii                   43877.0
 Idaho                    66657.0
 Illinois                473407.0
 Indiana                 304502.0
 Iowa                    171635.0
 Kansas                   92764.0
 Kentucky                138343.0
 Louisiana               144098.0
 Maine                    39431.0
 Maryland                175728.0
 Massachusetts           343409.0
 Michigan                255904.0
 Minnesota               282706.0
 Mississippi              67427.0
 Missouri                281705.0
 Montana                  37951.0
 Nebraska                 86474.0
 Nevada                   87853.0
 New Hampshire            52616.0
 New Jersey              237459.0
 New Mexico               40683.0
 New York                829501.0
 North Carolina          281964.0
 North Dakota             44715.0
 Northern Marianas          791.0
 Ohio                    397103.0
 Oklahoma                142216.0
 Oregon                  103860.0
 Pennsylvania            568058.0
 Puerto Rico             204727.0
 Rhode Island             50143.0
 South Carolina          112647.0
 South Dakota             44867.0
 Tennessee               194340.0
 Texas                   618314.0
 Utah                    172151.0
 Vermont                  36728.0
 Virgin Islands            2393.0
 Virginia                247775.0
 Washington              191633.0
 West Virginia           102109.0
 Wisconsin               237408.0
 Wyoming                  12225.0
Name: Size, dtype: float64